---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetFreeFormAccessor
zh: 钢筋、配筋
source: html/67be446c-e2e1-9dfe-315f-f5d6adc779b9.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetFreeFormAccessor Method

**中文**: 钢筋、配筋

Returns an interface providing access to free-form properties and methods for this Rebar element.

## Syntax (C#)
```csharp
public RebarFreeFormAccessor GetFreeFormAccessor()
```

## Returns
The interface providing access to free-form properties and methods for this Rebar element.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This method applies only to free form rebar.